app/controllers/catalogue_controller.rb

  def show
    if params[:category]
        @category = Category.find_by(url: params[:category])
    else
        @category = Category.first
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`url` = 'category1' LIMIT 1
SELECT `categories`.* FROM `categories` ORDER BY `categories`.`id` ASC LIMIT 1