app/controllers/items_controller.rb

INSERT INTO `items` (`created_at`, `picture_content_type`, `picture_file_name`, `picture_file_size`, `picture_updated_at`, `updated_at`) VALUES ('2014-05-29 22:11:04', 'image/jpeg', 'IMG_0758.JPG', 2039735, '2014-05-29 22:11:03', '2014-05-29 22:11:04')
---
  def create
    @item = Item.create( item_params )